#1.Створить вектор v із 100 елементів командою v <- rnorm(100). 
# Для цього вектору виведіть: 10-й елемент; елементи з 10-го по 20-й включно; 10 елементів починаючи з 20-го; елементи більше 0.

v<-rnorm(100)
v[10]
##[1]  0.5222539

v[10:20]

## [1]  0.52225395 -0.01128382  0.62564375 -0.77452092  1.61092603 -0.79160472  1.66355387  0.71624093 -1.47832315 -1.12366640 -0.89416192

v[20:29]
## [1] -0.8941619  0.2750205 -0.8237144  1.0251411  0.7333317 -0.4456840 -1.4511578  0.1023240  0.3212216  0.8662930
 
v[v>0]
##  [1] 0.33105988 0.48280037 0.91053394 0.08455202 1.24251364 0.79323844 0.52225395 0.62564375 1.61092603 1.66355387 0.71624093 0.27502052 1.02514110 0.73333171
## [15] 0.10232399 0.32122162 0.86629303 0.28508689 1.54145799 0.11334240 0.22791368 1.16236434 0.33686255 1.43729563 1.16829541 0.70852383 1.03188550 0.45691563
## [29] 0.52178825 0.07224355 1.41003896 0.19328069 0.21329867 0.77794875 1.43780621 0.81884824 0.17530900 0.63340476 0.16579095 0.41715896 1.38533906 0.30036508
## [43] 0.37153173 0.31256378 1.71146975 0.42184970 0.83380486 0.04611060 1.65811200 1.24342778 1.47668068


#2.Створіть фрейм (data frame) y командою y <- data.frame(a = rnorm(100), b = 1:100, cc = sample(letters, 100, replace = TRUE)). Для цього data frame виведіть: останні 10 строк; строки з 10 по 20 включно; 10-й елемент стовпця b; повністю стовпець cc, при цьому використайте ім’я стовпця.

y <- data.frame(a = rnorm(100), b = 1:100, cc = sample(letters, 100, replace = TRUE))
tail(y, 10)
##              a   b cc
## 91  -0.51346222  91  s
## 92  -1.35297044  92  j
## 93   0.61177362  93  g
## 94  -3.18791374  94  b
## 95   0.06754274  95  m
## 96  -0.30453381  96  f
## 97  -1.00997439  97  v
## 98  -1.18315266  98  o
## 99  -0.36018244  99  k
## 100 -0.98406919 100  k

tail(head(y, 20), 11)
##             a  b cc
## 10  1.2224066 10  i
## 11 -1.5800793 11  x
## 12  0.7640168 12  j
## 13  0.6233098 13  k
## 14 -0.9751224 14  a
## 15 -1.1412184 15  v
## 16  0.7506197 16  y
## 17  0.8002176 17  s
## 18 -1.5449082 18  n
## 19  0.7528627 19  a
## 20 -0.9189570 20  p

y[10,"b"]
##[1] 10

y[,"cc"]
##  [1] d n x q u b g x q i x j k a v y s n a p o z y j l l u n o m w a y b w i g p g y d k u l e g t e k f u h n u h g h l n x o h c x h y a c y x u b p r j b e a o t f
## [82] x d w g i h b t l s j g b m f v o k k
## Levels: a b c d e f g h i j k l m n o p q r s t u v w x y z


# 3.Створіть вектор z з елементами 1, 2, 3, NA, 4, NA, 5, NA. Для цього вектору: виведіть всі елементи, які не NA; підрахуйте середнє значення всіх елементів цього вектору без NA значень та з NA значеннями.

z<-c(1, 2, 3, NA, 4, NA, 5, NA)

mean(z, trim=0, na.rm = TRUE)
##[1] 3
mean(z)
##[1] NA
